/**********************实验测试程序************************
*  平台：BST-V51 + Keil U5 + STC89C52RC
*  名称：蜂鸣器实验
*  日期：2019-9-7
*  姓名：ZhangHJ
*  说明：蜂鸣器交替发出声音
***********************************************************/
#include<reg52.h>
#define ON 0
#define OFF 1

sbit FM = P2^3;

/**********************************************************
*  函数名称：低精度延时函数
*  日期：2019-9-7
*  姓名：ZhangHJ
*  说明：嵌套循环延时
***********************************************************/
void delay_ms(unsigned int mstime)
{
	int i,j;
	for(i=mstime; i>=0; i--)
		for(j=112; j>=0; j--);
}


int main()
{
	while(1)
	{
		FM = ON;
		delay_ms(200);
		FM = OFF;
		delay_ms(200);
	}
}