/**********************实验测试程序************************
*  平台：BST-V51 + Keil U5 + STC89C52RC
*  名称：独立按键实验
*  日期：2019-9-7
*  姓名：ZhangHJ
*  说明：独立按键控制LED
***********************************************************/
#include<reg52.h>
#include"bstv51.h"



/**********************************************************
*  函数名称：独立键盘控制LED函数
*  日期：2019-9-7
*  姓名：ZhangHJ
*  说明：这个函数有问题！！！！不能使用！！
*				 函数预期功能是:通过KeyNum按键,控制LEDNum的亮灭
* 			 该函数需要两个sbit变量作为形参,但是sbit变量不能进行参数传递,
*				 所以功能暂未实现
***********************************************************/
/*
void key_control_led(sbit KeyNum, sbit LEDNum)
{
	if(KeyNum == 0)
		{
			delay_ms(10);
			if(KeyNum == 0)		//加入键盘消抖处理
			{
//			while(KeyNum == 0);			//键盘送开时触发
//			LEDNum = ~LEDNum;
				LEDNum = 0;
			}
		}
		else
		{
			LEDNum = 1;
		}
}
*/




/**********************************************************
*  函数名称：独立键盘控制LED主函数
*  日期：2019-9-7
*  姓名：ZhangHJ
*  说明：按下Key1后,LED5和LED6点亮
*				 L0~L7表示LED,K1~K4表示独立按键,已经在bstv51.h中进行了位定义
* 			 参考程序66、67行,可以实现键盘松开时触发的功能
*				 
***********************************************************/
int main()
{
	bstv51_init();		//板子初始化
	
	P1 = 0xff;				//初始化LED全灭
	while(1)
	{
		if(K1 == 0)
		{
			delay_ms(10);
			if(K1 == 0)		//加入键盘消抖处理
			{
//			while(K1 == 0);			//键盘送开时触发
//			L0 = ~L0;
				L5 = 0;
				L6 = 0;
			}
		}
		else
		{
			L5 = 1;
			L6 = 1;
		}
		
		//key_control_led(K1, L0);
	}
}