/**********************实验测试程序************************
*  平台：BST-V51 + Keil U5 + STC89C52RC
*  名称：数码管实验
*  日期：2019-9-7
*  姓名：ZhangHJ
*  说明：数码管静态显示
***********************************************************/
#include<reg52.h>
#include"bstv51.h"
#define ON 1				//使能
#define OFF 0				//使不能

sbit DUAN = P2^6;		//数据段选
sbit WEI = P2^7;		//数码管位选
int i = 0;

//定义数字段选数组
uint duan[17] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71,0x00};
//定义单个数码管的16进制数组
uint wei[8] = {0xfe,0xfd,0xfb,0xf7,0xef,0xdf,0xbf,0x7f};



/**********************************************************
*  函数名称：单数码管显示函数
*  日期：2019-9-7
*  姓名：ZhangHJ
*  说明：能控制8个数码管的某一位输出0-F
* 			 参数number表示需要显示的数字
* 			 参数weixuan表示第几个数码管
***********************************************************/
void light_one(int number, int weixuan)
{
	P0 = duan[number];
	DUAN = ON;				//段选使能
	DUAN = OFF;				//段选使不能
	
	P0 = wei[weixuan];//位选地址
	WEI = ON;					//位选使能
	WEI = OFF;				//位选使不能
}



/**********************************************************
*  函数名称：多数码管伪动态显示函数
*  日期：2019-9-7
*  姓名：ZhangHJ
*  说明：需要调用light_one()函数,实现8个数码管同时显示的效果
* 			 其实就是延时函数缩短了，利用余晖效应造成8个数码管同时亮的效果
***********************************************************/
void light_two()
{
	light_one(1, 0);
	delay_ms(1);
	light_one(2, 1);
	delay_ms(1);
	light_one(3, 2);
	delay_ms(1);
	light_one(4, 3);
	delay_ms(1);
	light_one(5, 4);
	delay_ms(1);
	light_one(6, 5);
	delay_ms(1);
	light_one(7, 6);
	delay_ms(1);
	light_one(8, 7);
	delay_ms(1);
}



/**********************************************************
*  函数名称：多数码循环显示函数
*  日期：2019-9-7
*  姓名：ZhangHJ
*  说明：需要调用light_one()函数,实现多个数码管循环显示的效果
* 			 利用延时函数进行循环显示
***********************************************************/
void light_three()
{
	for(i=0; i<8; i++)
	{
		light_one(i+1, i);
		delay_ms(500);
	}
}



/**********************************************************
*  函数名称：多数码动态显示函数
*  日期：2019-9-7
*  姓名：ZhangHJ
*  说明：需要调用light_one()函数,实现多个数码管动态显示的效果。
* 			 可以利用延时函数进行循环显示,如果不用延时函数,需要在每
*				 一位数码管点亮之后，利用位选信号将其关闭.实际体验中,
*				 利用位选的效果不好(发光很弱)
***********************************************************/
void light_four()
{
	for(i=0; i<8; i++)
	{
		light_one(i+1, i);
		P0 = 0xff;				//位选全部关闭
		WEI = ON;					//位选使能
		WEI = OFF;				//位选使不能
	}
}


void main()
{
	
	bstv51_init();		//单片机初始化
	
	//light_one(5, 6);
	//light_two();
	light_three();
	//light_four();
	//delay_ms(600);

}