/**********************实验测试程序************************
*  平台：BST-V51 + Keil U5 + STC89C52RC
*  名称：定时器中断实验
*  日期：2019-9-8
*  姓名：ZhangHJ
*  说明：使用定时器中断控制LED
***********************************************************/
#include<reg52.h>
#include"bstv51.h"

uint i = 0;					//计时器全局变量

/**********************************************************
*  函数名称：定时器初始化函数
*  日期：2019-9-8
*  姓名：ZhangHJ
*  说明：设置计时器模式寄存器(TMOD)
*				 由TH0和TL0做定时数,设置工作模式1,16位计时器(计时范围0~65535=>0~71.11ms)
*				 参数High设置计时器高8位数据;Low设置计时器低8位数据
***********************************************************/
void init_timer0(unsigned int High, unsigned int Low)
{
	TMOD |= 0x01;			//设置计时器模式寄存器
	TH0 = High;				//计时器高八位
	TL0 = Low;				//计时器低八位
	EA = 1;						//开启整体计时器允许
	ET0 = 1;					//计时器中断允许
	TR0 = 1;					//T0定时器开始运行
}



/**********************************************************
*  函数名称：数码管测试函数
*  日期：2019-9-8
*  姓名：ZhangHJ
*  说明：开启数码管所有段选位和位选,数码管全亮
***********************************************************/
void led_all_on(void)
{
	P0 = 0xff;
	DU = 1;
	DU = 0;
	P0 = 0x00;
	WE = 1;
	WE = 0;
}



/**********************************************************
*  函数名称：定时器测试主函数
*  日期：2019-9-8
*  姓名：ZhangHJ
*  说明：设置计时器定时时间为50ms,主循环判断计时0.5s(计时器累加10次),
*				 LED5取反,LED闪烁周期为1S.
***********************************************************/
int main()
{
	bstv51_init();
	init_timer0(0x4C, 0x00);
	//led_all_on();
	while(1)
	{
		if(i == 10)
		{
			L5 = ~L5;
			i = 0;
		}
	}
}



/**********************************************************
*  函数名称：定时器测试函数
*  日期：2019-9-8
*  姓名：ZhangHJ
*  说明：重置定时器高八位和低八位数据,计时器变量 i 加 1 
*				 因为定时器中断时间为50ms(时间很短),所以中断服务函数中,
*				 不建议写太长的执行语句。
***********************************************************/
void timer_isp(void) interrupt 1
{
	TH0 = 0X4C;				//计时器高八位清0
	TL0 = 0X00;				//计时器低八位清0
	i ++;
}